<?

$g_months = Array(
	"1" => "Январь",
	"2" => "Февраль",
	"3" => "Март",
	"4" => "Апрель",
	"5" => "Май",
	"6" => "Июнь",
	"7" => "Июль",
	"8" => "Август",
	"9" => "Сентябрь",
	"10" => "Октябрь",
	"11" => "Ноябрь",
	"12" => "Декабрь"
);


$g_messages = Array(
	"required"	=> "Поле <b>{name}</b> обязательное для заполнения.",
	"cantsave"	=> "Невозможно сохранить файл <b>{file}</b>",
	"tobigsize"	=> "Загружаемый файл <b>{file}</b> имеет слишком большой размер </b>{bigsize}</b>. Максимально допустимый размер <b>{size}</b>.",
	"badext"	=> "Файл <b>{file}</b> имеет некорректный тип. Допустимый тип <b>{exts}</b>.",
	"smin"		=> "Поле <b>{name}</b> должно быть минимум <b>{min}</b> символов.",
	"smax"		=> "Поле <b>{name}</b> должно быть максимум <b>{max}</b> символов.",
	"imin"		=> "Поле <b>{name}</b> не должно быть меньше <b>{min}</b>.",
	"imax"		=> "Поле <b>{name}</b> не должно быть больше <b>{max}</b>.",
	"unique"	=> "Поле <b>{name}</b> должно быть уникальным. Запись с таким занчением уже существует.",
	"incorrect"	=> "Поле <b>{name}</b> некорректно.",
	"no_such_record" => "Искомой записи в базе данных не существует.",
);



?>